#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaPickupMessageItem

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function AthenaPickupMessageItem.AthenaPickupMessageItem_C.ExecuteUbergraph_AthenaPickupMessageItem
// 0x0008 (0x0008 - 0x0000)
struct AthenaPickupMessageItem_C_ExecuteUbergraph_AthenaPickupMessageItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_OldStackSize;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function AthenaPickupMessageItem.AthenaPickupMessageItem_C.OnStackSizeChanged
// 0x0004 (0x0004 - 0x0000)
struct AthenaPickupMessageItem_C_OnStackSizeChanged final
{
public:
	int32                                         OldStackSize;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function AthenaPickupMessageItem.AthenaPickupMessageItem_C.Setup
// 0x0090 (0x0090 - 0x0000)
struct AthenaPickupMessageItem_C_Setup final
{
public:
	class UFortItem*                              Picked_Up_Item_0;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            CallFunc_GetItemSmallPreviewImageBrush_ReturnValue; // 0x0008(0x0088)()
};

}

