#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CollectionBookItemPicker

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CollectionBookItemPicker.CollectionBookItemPicker_C
// 0x0060 (0x0300 - 0x02A0)
class UCollectionBookItemPicker_C final : public UFortCollectionBookPicker
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(Transient, DuplicateTransient)
	struct FDataTableRowHandle                    BackInputActionName;                               // 0x02A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class FText                                   ConfirmSlotItemTitle;                              // 0x02B8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   ConfirmSlotItemMessage;                            // 0x02D0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FDataTableRowHandle                    ConfirmInputActionName;                            // 0x02E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class UCollectionBookRecycleSlotResultsWidget_C* RecycleSlotItemWidget;                          // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CollectionBookItemPicker(int32 EntryPoint);
	void ShowSlotItemConfirmation(class UFortItem* SelectedItem);
	void Construct();
	void DialogResult_C897FB8741239C9DAE2430AD3D91A030(EFortDialogResult Result, class FName ResultName, bool bWaitingForLatentActionCompletion, const struct FFortDialogExternalLatentActionHandle& WaitingDialogHandle);
	void HandleItemSelected(class UObject* ItemSelected, bool IsSelected);
	void HandleCommitAction(bool* Passthrough);
	void Get_Type_Text(class UFortItem* Item, class FText* Type);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CollectionBookItemPicker_C">();
	}
	static class UCollectionBookItemPicker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCollectionBookItemPicker_C>();
	}
};

}

