#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CommonInput

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "BlueprintContext_classes.hpp"


namespace SDK
{

// Class CommonInput.CommonInputContext
// 0x0098 (0x00C0 - 0x0028)
class UCommonInputContext final : public UBlueprintContextBase
{
public:
	UMulticastDelegateProperty_                   OnInputMethodChanged;                              // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x78];                                      // 0x0038(0x0078)(Fixing Size After Last Property [ Dumper-7 ])
	ECommonInputType                              CurrentInputType;                                  // 0x00B0(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ECommonGamepadType                            GamepadInputType;                                  // 0x00B1(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B2[0xE];                                       // 0x00B2(0x000E)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetCurrentInputType(ECommonInputType NewInputType);
	void SetGamepadInputType(ECommonGamepadType InGamepadInputType);

	ECommonGamepadType GetCurrentGamepadType() const;
	ECommonInputType GetCurrentInputType() const;
	bool IsUsingPointerInput() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CommonInputContext">();
	}
	static class UCommonInputContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonInputContext>();
	}
};

}

