#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DefaultObjectiveContentWidget

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DefaultObjectiveContentWidget.DefaultObjectiveContentWidget_C
// 0x0028 (0x0240 - 0x0218)
class UDefaultObjectiveContentWidget_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0218(0x0008)(Transient, DuplicateTransient)
	class UMissionObjectiveProgressBarsManager_C* MissionObjectiveProgressBarsManager;               // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             RichTextSlot;                                      // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AFortObjectiveBase*                     TrackedObjective;                                  // 0x0230(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bConfigureAsHUD;                                   // 0x0238(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_DefaultObjectiveContentWidget(int32 EntryPoint);
	void HandleUpdate(class AFortMissionState* MissionState);
	void HandleObjectiveVisibilityChanged(const class AFortObjectiveBase* Objective, bool bNewVisibility);
	void HandleObjectiveStatusChanged(const class AFortObjectiveBase* Objective, EFortObjectiveStatus NewStatus);
	void Setup(class AFortObjectiveBase* Objective, bool bInConfigureAsHUD);
	void Update();
	void GetRichTextBlock(class UMissionRichText_C** MissionRichTextBlock);
	void CreateRichTextBlock(const class FText& Text);
	void HandleTimerComponentUpdated(class UFortMissionTimerComponent* InTimerComponent);
	void GetHeightEstimate(float* Height);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DefaultObjectiveContentWidget_C">();
	}
	static class UDefaultObjectiveContentWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDefaultObjectiveContentWidget_C>();
	}
};

}

