#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FlingerInterface

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function FlingerInterface.FlingerInterface_C.FlingerSpawnedAnEnemy
// 0x0010 (0x0010 - 0x0000)
struct FlingerInterface_C_FlingerSpawnedAnEnemy final
{
public:
	class AFortAIPawn*                            EnemySpawned;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortProjectileBase*                    ProjectileThatSpawnedThisEnemy;                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function FlingerInterface.FlingerInterface_C.CanFlingerSpawnAnEnemy
// 0x0008 (0x0008 - 0x0000)
struct FlingerInterface_C_CanFlingerSpawnAnEnemy final
{
public:
	class AActor*                                 ActorWhoAsked;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function FlingerInterface.FlingerInterface_C.FlingerThrewAProjectileContainingAnEnemy
// 0x0008 (0x0008 - 0x0000)
struct FlingerInterface_C_FlingerThrewAProjectileContainingAnEnemy final
{
public:
	class AFortProjectileBase*                    Projectile;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function FlingerInterface.FlingerInterface_C.FlingerEnemyFailedToSpawn
// 0x0008 (0x0008 - 0x0000)
struct FlingerInterface_C_FlingerEnemyFailedToSpawn final
{
public:
	class AFortProjectileBase*                    FailedProjectile;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function FlingerInterface.FlingerInterface_C.AlertEnemySpawnedByFlinger
// 0x0018 (0x0018 - 0x0000)
struct FlingerInterface_C_AlertEnemySpawnedByFlinger final
{
public:
	struct FVector                                PushMomentum;                                      // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PushDuration;                                      // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  OwningFlinger;                                     // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function FlingerInterface.FlingerInterface_C.FlingerEnemyDied
// 0x0008 (0x0008 - 0x0000)
struct FlingerInterface_C_FlingerEnemyDied final
{
public:
	class APawn*                                  PawnThatDied;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

