#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortniteUI

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "SlateCore_structs.hpp"
#include "GameSubCatalog_structs.hpp"
#include "InputCore_structs.hpp"
#include "Slate_structs.hpp"
#include "Party_structs.hpp"
#include "CommonUI_structs.hpp"


namespace SDK::Params
{

// Function FortniteUI.FortSquadStatsWidgetBase.GetLocalPlayerId
// 0x0028 (0x0028 - 0x0000)
struct FortSquadStatsWidgetBase_GetLocalPlayerId final
{
public:
	struct FUniqueNetIdRepl                       ReturnValue;                                       // 0x0000(0x0028)(Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortChallengeBundleInfo.GetAchievedCount
// 0x0010 (0x0010 - 0x0000)
struct FortChallengeBundleInfo_GetAchievedCount final
{
public:
	int32                                         OutTotalAchievedCount;                             // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutTotalRequiredCount;                             // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutAchievedPercent;                                // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutThresholdPercent;                               // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortChallengeBundleInfo.GetBundleDefinition
// 0x0008 (0x0008 - 0x0000)
struct FortChallengeBundleInfo_GetBundleDefinition final
{
public:
	class UFortChallengeBundleItemDefinition*     ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortChallengeBundleInfo.GetOwningBundleCategoryInfo
// 0x0008 (0x0008 - 0x0000)
struct FortChallengeBundleInfo_GetOwningBundleCategoryInfo final
{
public:
	class UFortChallengeBundleCategoryInfo*       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortChallengeBundleInfo.GetRewardItem
// 0x0008 (0x0008 - 0x0000)
struct FortChallengeBundleInfo_GetRewardItem final
{
public:
	class UFortItem*                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortChallengeBundleInfo.HasQuestReward
// 0x0018 (0x0018 - 0x0000)
struct FortChallengeBundleInfo_HasQuestReward final
{
public:
	class UFortItemDefinition*                    ItemDef;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutRecievedCount;                                  // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutTotalCount;                                     // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FortniteUI.FortChallengeBundleInfo.IsCompleted
// 0x0001 (0x0001 - 0x0000)
struct FortChallengeBundleInfo_IsCompleted final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortChallengeBundleInfo.IsRewardThresholdAchieved
// 0x0001 (0x0001 - 0x0000)
struct FortChallengeBundleInfo_IsRewardThresholdAchieved final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortChallengeBundleInfo.IsUnlocked
// 0x0020 (0x0020 - 0x0000)
struct FortChallengeBundleInfo_IsUnlocked final
{
public:
	class FText                                   LockedReason;                                      // 0x0000(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FortniteUI.FortSwipePanel.GetSwipeInfo
// 0x000C (0x000C - 0x0000)
struct FortSwipePanel_GetSwipeInfo final
{
public:
	int32                                         OutIndex;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              OutSwipePercentage;                                // 0x0004(0x0008)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortActivatablePanel.RestoreCenterWidget
// 0x0008 (0x0008 - 0x0000)
struct FortActivatablePanel_RestoreCenterWidget final
{
public:
	class UWidget*                                FallbackWidget;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortActivatablePanel.RestoreScrollWidget
// 0x0008 (0x0008 - 0x0000)
struct FortActivatablePanel_RestoreScrollWidget final
{
public:
	class UWidget*                                FallbackWidget;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.AthenaAccountContext.GetBattleBookPurchaseLimit
// 0x0008 (0x0008 - 0x0000)
struct AthenaAccountContext_GetBattleBookPurchaseLimit final
{
public:
	int32                                         MaxNumLevelsPossibleToPurchase;                    // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BonusLevelsGranted;                                // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.AthenaAccountContext.GetCurrentSeasonDefinition
// 0x0008 (0x0008 - 0x0000)
struct AthenaAccountContext_GetCurrentSeasonDefinition final
{
public:
	class UAthenaSeasonItemDefinition*            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.AthenaAccountContext.SimulateBattleBookPurchase
// 0x000C (0x000C - 0x0000)
struct AthenaAccountContext_SimulateBattleBookPurchase final
{
public:
	int32                                         NumLevelsToPurchase;                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BonusLevelsGranted;                                // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverLimit;                                        // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FortniteUI.AthenaAccountContext.GetCurrentSeasonName
// 0x0018 (0x0018 - 0x0000)
struct AthenaAccountContext_GetCurrentSeasonName final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function FortniteUI.AthenaAccountContext.GetCurrentSeasonNumber
// 0x0004 (0x0004 - 0x0000)
struct AthenaAccountContext_GetCurrentSeasonNumber final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.AthenaAwardAlertBase.OnAwardGranted
// 0x0008 (0x0008 - 0x0000)
struct AthenaAwardAlertBase_OnAwardGranted final
{
public:
	class UFortAwardItemDefinition*               AwardDefinition;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.AthenaAwardAlertBase.SetDataSource
// 0x0008 (0x0008 - 0x0000)
struct AthenaAwardAlertBase_SetDataSource final
{
public:
	class UAthenaPlayerViewModel*                 PlayerViewModel;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortSurvivorSquadStatMatchesBase.AddStatMatch
// 0x0008 (0x0008 - 0x0000)
struct FortSurvivorSquadStatMatchesBase_AddStatMatch final
{
public:
	class UFortSurvivorSquadStatMatchBase*        SetBonus;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortSurvivorSquadStatMatchesBase.SetIdOfSquadToManageBP
// 0x0008 (0x0008 - 0x0000)
struct FortSurvivorSquadStatMatchesBase_SetIdOfSquadToManageBP final
{
public:
	class FName                                   SquadId;                                           // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortSurvivorSquadStatMatchesBase.SetSummaryView
// 0x0001 (0x0001 - 0x0000)
struct FortSurvivorSquadStatMatchesBase_SetSummaryView final
{
public:
	bool                                          bInSummaryView;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortSurvivorSquadStatMatchesBase.GetIdOfSquadToManageBP
// 0x0008 (0x0008 - 0x0000)
struct FortSurvivorSquadStatMatchesBase_GetIdOfSquadToManageBP final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortSurvivorSquadStatMatchesBase.TryGetStaticSquadDataBP
// 0x0090 (0x0090 - 0x0000)
struct FortSurvivorSquadStatMatchesBase_TryGetStaticSquadDataBP final
{
public:
	struct FHomebaseSquad                         OutSquadData;                                      // 0x0000(0x0088)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0088(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FortniteUI.FortChallengeBundleCategoryInfo.GetChallengeBundleInfos
// 0x0010 (0x0010 - 0x0000)
struct FortChallengeBundleCategoryInfo_GetChallengeBundleInfos final
{
public:
	TArray<class UFortChallengeBundleInfo*>       ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortChallengeBundleCategoryInfo.GetFirstScheduleDefinition
// 0x0008 (0x0008 - 0x0000)
struct FortChallengeBundleCategoryInfo_GetFirstScheduleDefinition final
{
public:
	class UFortChallengeBundleScheduleDefinition* ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortChallengeBundleCategoryInfo.GetNumberOfBundles
// 0x0004 (0x0004 - 0x0000)
struct FortChallengeBundleCategoryInfo_GetNumberOfBundles final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortChallengeBundleTreeItemWidget.ExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct FortChallengeBundleTreeItemWidget_ExpansionChanged final
{
public:
	bool                                          bExpanded;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortChallengeBundleTreeItemWidget.SetupAsChallengeBundle
// 0x0008 (0x0008 - 0x0000)
struct FortChallengeBundleTreeItemWidget_SetupAsChallengeBundle final
{
public:
	class UFortChallengeBundleInfo*               Bundle;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortChallengeBundleTreeItemWidget.SetupAsChallengeBundleSchedule
// 0x0008 (0x0008 - 0x0000)
struct FortChallengeBundleTreeItemWidget_SetupAsChallengeBundleSchedule final
{
public:
	class UFortChallengeBundleCategoryInfo*       Schedule;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortChallengeBundleTreeItemWidget.GetChallengeBundleInfo
// 0x0008 (0x0008 - 0x0000)
struct FortChallengeBundleTreeItemWidget_GetChallengeBundleInfo final
{
public:
	class UFortChallengeBundleInfo*               ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortSquadSlotItemPickerTileButton.HandleItemSlottedToDifferentSquad
// 0x0010 (0x0010 - 0x0000)
struct FortSquadSlotItemPickerTileButton_HandleItemSlottedToDifferentSquad final
{
public:
	struct FHomebaseSquadSlotId                   SquadSlotId;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortSquadSlotItemPickerTileButton.GetSlottingRestrictionReasons
// 0x0010 (0x0010 - 0x0000)
struct FortSquadSlotItemPickerTileButton_GetSlottingRestrictionReasons final
{
public:
	TArray<EFortSquadSlottingRestrictionReason>   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortChallengeBundleWidget.Setup
// 0x0008 (0x0008 - 0x0000)
struct FortChallengeBundleWidget_Setup final
{
public:
	class UFortChallengeBundleInfo*               Info;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortChallengeBundleWidget.GetChallengeBundleInfo
// 0x0008 (0x0008 - 0x0000)
struct FortChallengeBundleWidget_GetChallengeBundleInfo final
{
public:
	class UFortChallengeBundleInfo*               ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortChallengeBundleWidget.HasSiblingBundles
// 0x0001 (0x0001 - 0x0000)
struct FortChallengeBundleWidget_HasSiblingBundles final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.AthenaChallengeBundleScheduleScreenBase.GetChallengeCategoryInfos
// 0x0010 (0x0010 - 0x0000)
struct AthenaChallengeBundleScheduleScreenBase_GetChallengeCategoryInfos final
{
public:
	TArray<class UFortChallengeBundleCategoryInfo*> OutCategoryInfos;                                // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortHUDElementWidget.HandleOnHUDElementVisibilityChanged
// 0x0020 (0x0020 - 0x0000)
struct FortHUDElementWidget_HandleOnHUDElementVisibilityChanged final
{
public:
	struct FGameplayTagContainer                  HiddenHUDElementTags;                              // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortHUDElementWidget.OnVisibilitySetEvent
// 0x0001 (0x0001 - 0x0000)
struct FortHUDElementWidget_OnVisibilitySetEvent final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortSquadSlotsView.CreateAndAddSquadSlotButton
// 0x0080 (0x0080 - 0x0000)
struct FortSquadSlotsView_CreateAndAddSquadSlotButton final
{
public:
	int32                                         SquadSlotIndex;                                    // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHomebaseSquadSlot                     SquadSlotDefinition;                               // 0x0008(0x0068)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UWidget*                                OutSquadSlotButtonHost;                            // 0x0070(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortSquadSlotSelectorButton*           ReturnValue;                                       // 0x0078(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortSquadSlotsView.HandleButtonClicked
// 0x0010 (0x0010 - 0x0000)
struct FortSquadSlotsView_HandleButtonClicked final
{
public:
	class UCommonButton*                          CommittedButton;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ButtonIndex;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FortniteUI.FortSquadSlotsView.HandleButtonDoubleClicked
// 0x0010 (0x0010 - 0x0000)
struct FortSquadSlotsView_HandleButtonDoubleClicked final
{
public:
	class UCommonButton*                          CommittedButton;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ButtonIndex;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FortniteUI.FortSquadSlotsView.HandleHoveredButtonChanged
// 0x0010 (0x0010 - 0x0000)
struct FortSquadSlotsView_HandleHoveredButtonChanged final
{
public:
	class UCommonButton*                          HoveredButton;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ButtonIndex;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FortniteUI.FortSquadSlotsView.HandleRequestOpenSquadSlot
// 0x0004 (0x0004 - 0x0000)
struct FortSquadSlotsView_HandleRequestOpenSquadSlot final
{
public:
	int32                                         SquadSlotIndex;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortSquadSlotsView.HandleRequestViewInAll
// 0x0004 (0x0004 - 0x0000)
struct FortSquadSlotsView_HandleRequestViewInAll final
{
public:
	int32                                         SquadSlotIndex;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortSquadSlotsView.HandleSelectedButtonChanged
// 0x0010 (0x0010 - 0x0000)
struct FortSquadSlotsView_HandleSelectedButtonChanged final
{
public:
	class UCommonButton*                          SelectedButton;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ButtonIndex;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FortniteUI.FortSquadSlotsView.SelectSlot
// 0x0004 (0x0004 - 0x0000)
struct FortSquadSlotsView_SelectSlot final
{
public:
	int32                                         SquadSlotIndex;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortSquadSlotsView.SetIdOfSquadToManageBP
// 0x0008 (0x0008 - 0x0000)
struct FortSquadSlotsView_SetIdOfSquadToManageBP final
{
public:
	class FName                                   SquadId;                                           // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortSquadSlotsView.SetInPreviewMode
// 0x0001 (0x0001 - 0x0000)
struct FortSquadSlotsView_SetInPreviewMode final
{
public:
	bool                                          bPreview;                                          // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortSquadSlotsView.SetIsSelectionLocked
// 0x0001 (0x0001 - 0x0000)
struct FortSquadSlotsView_SetIsSelectionLocked final
{
public:
	bool                                          ShouldSelectionBeLocked;                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortSquadSlotsView.TryGetSelectedSquadSlotSortTypes
// 0x0018 (0x0018 - 0x0000)
struct FortSquadSlotsView_TryGetSelectedSquadSlotSortTypes final
{
public:
	struct FSquadSlotSortTypes                    OutSlotSortTypes;                                  // 0x0000(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FortniteUI.FortSquadSlotsView.GetIdOfSquadToManageBP
// 0x0008 (0x0008 - 0x0000)
struct FortSquadSlotsView_GetIdOfSquadToManageBP final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortSquadSlotsView.GetIndexOfSelectedSquadSlot
// 0x0004 (0x0004 - 0x0000)
struct FortSquadSlotsView_GetIndexOfSelectedSquadSlot final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortSquadSlotsView.TryGetStaticSquadDataBP
// 0x0090 (0x0090 - 0x0000)
struct FortSquadSlotsView_TryGetStaticSquadDataBP final
{
public:
	struct FHomebaseSquad                         OutSquadData;                                      // 0x0000(0x0088)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0088(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FortniteUI.AthenaCompassBase.BindToModel
// 0x0008 (0x0008 - 0x0000)
struct AthenaCompassBase_BindToModel final
{
public:
	class UAthenaPlayerViewModel*                 ViewModel;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortItemPickerBase.CanItemBeComitted
// 0x0010 (0x0010 - 0x0000)
struct FortItemPickerBase_CanItemBeComitted final
{
public:
	const class UFortItem*                        ItemToCommit;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FortniteUI.FortItemPickerBase.HandlePickerItemClicked
// 0x0008 (0x0008 - 0x0000)
struct FortItemPickerBase_HandlePickerItemClicked final
{
public:
	const class UObject*                          ObjectOfClickedTile;                               // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortItemPickerBase.HandlePickerItemDoubleClicked
// 0x0008 (0x0008 - 0x0000)
struct FortItemPickerBase_HandlePickerItemDoubleClicked final
{
public:
	const class UObject*                          ObjectOfClickedTile;                               // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortItemPickerBase.HandlePickerItemHovered
// 0x0008 (0x0008 - 0x0000)
struct FortItemPickerBase_HandlePickerItemHovered final
{
public:
	const class UObject*                          ObjectOfHoveredTile;                               // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortItemPickerBase.HandlePickerItemSelected
// 0x0010 (0x0010 - 0x0000)
struct FortItemPickerBase_HandlePickerItemSelected final
{
public:
	const class UObject*                          ObjectWhoseSelectionChanged;                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsSelected;                                       // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FortniteUI.FortItemPickerBase.HandlePickerTileCreated
// 0x0008 (0x0008 - 0x0000)
struct FortItemPickerBase_HandlePickerTileCreated final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortItemPickerBase.HandlePickerTileDestroyed
// 0x0008 (0x0008 - 0x0000)
struct FortItemPickerBase_HandlePickerTileDestroyed final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortItemPickerBase.SetSelectedIndex
// 0x0008 (0x0008 - 0x0000)
struct FortItemPickerBase_SetSelectedIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FortniteUI.FortItemPickerBase.SetSelectedItem
// 0x0008 (0x0008 - 0x0000)
struct FortItemPickerBase_SetSelectedItem final
{
public:
	const class UFortItem*                        ItemToSelect;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortItemPickerBase.TryCommitSelectedItem
// 0x0001 (0x0001 - 0x0000)
struct FortItemPickerBase_TryCommitSelectedItem final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortItemPickerBase.GetIndexForItem
// 0x0010 (0x0010 - 0x0000)
struct FortItemPickerBase_GetIndexForItem final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FortniteUI.FortItemPickerBase.GetSelectedItem
// 0x0008 (0x0008 - 0x0000)
struct FortItemPickerBase_GetSelectedItem final
{
public:
	class UFortItem*                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortStoreSummary.SetCards
// 0x0010 (0x0010 - 0x0000)
struct FortStoreSummary_SetCards final
{
public:
	TArray<struct FCard>                          Cards;                                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FortniteUI.AthenaCustomizationPicker.BeginCustomizationCategory
// 0x0008 (0x0008 - 0x0000)
struct AthenaCustomizationPicker_BeginCustomizationCategory final
{
public:
	EAthenaCustomizationCategory                  Category;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SubslotToEdit;                                     // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortSquadTypeLandingPageBase.CreateAndAddSquadButton
// 0x0010 (0x0010 - 0x0000)
struct FortSquadTypeLandingPageBase_CreateAndAddSquadButton final
{
public:
	class FName                                   SquadId;                                           // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortSquadSelectorButton*               ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortSquadTypeLandingPageBase.HandleBackInputAction
// 0x0001 (0x0001 - 0x0000)
struct FortSquadTypeLandingPageBase_HandleBackInputAction final
{
public:
	bool                                          bPassThrough;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortSquadTypeLandingPageBase.HandleManageInputAction
// 0x0001 (0x0001 - 0x0000)
struct FortSquadTypeLandingPageBase_HandleManageInputAction final
{
public:
	bool                                          bPassThrough;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortSquadSlotItemDetailElementWidget.SetIdOfSquadSlotToManageBP
// 0x0010 (0x0010 - 0x0000)
struct FortSquadSlotItemDetailElementWidget_SetIdOfSquadSlotToManageBP final
{
public:
	class FName                                   SquadId;                                           // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SquadSlotIndex;                                    // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FortniteUI.FortSquadSlotItemDetailElementWidget.GetIdOfSquadSlotToManageBP
// 0x0010 (0x0010 - 0x0000)
struct FortSquadSlotItemDetailElementWidget_GetIdOfSquadSlotToManageBP final
{
public:
	class FName                                   OutSquadId;                                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutSquadSlotIndex;                                 // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FortniteUI.FortSquadSlotItemDetailElementWidget.GetItemInSquadSlotBP
// 0x0010 (0x0010 - 0x0000)
struct FortSquadSlotItemDetailElementWidget_GetItemInSquadSlotBP final
{
public:
	const class ULocalPlayer*                     LocalPlayer;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortItem*                              ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortSquadSlotItemDetailElementWidget.IsSquadSlotLockedBP
// 0x0001 (0x0001 - 0x0000)
struct FortSquadSlotItemDetailElementWidget_IsSquadSlotLockedBP final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.AthenaCustomizationScreenBase.GetFavoriteItemForCategory
// 0x0010 (0x0010 - 0x0000)
struct AthenaCustomizationScreenBase_GetFavoriteItemForCategory final
{
public:
	EAthenaCustomizationCategory                  CustomizationType;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SubslotIndex;                                      // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortItem*                              ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.AthenaCustomizationSlotSelectorButton.SetCustomizationType
// 0x0008 (0x0008 - 0x0000)
struct AthenaCustomizationSlotSelectorButton_SetCustomizationType final
{
public:
	EAthenaCustomizationCategory                  NewType;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InSubslotIndex;                                    // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.BacchusHUDElement.OnHUDStateUpdate
// 0x0010 (0x0010 - 0x0000)
struct BacchusHUDElement_OnHUDStateUpdate final
{
public:
	struct FFortHUDState                          NewState;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function FortniteUI.AthenaEquippedItemBase.AmmoChanged
// 0x000C (0x000C - 0x0000)
struct AthenaEquippedItemBase_AmmoChanged final
{
public:
	int32                                         MagazineAmmoCount;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BackupAmmoCount;                                   // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TotalRemaining;                                    // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.AthenaEquippedItemBase.AmmoTypeChanged
// 0x0010 (0x0010 - 0x0000)
struct AthenaEquippedItemBase_AmmoTypeChanged final
{
public:
	class AFortWeaponRanged*                      RangedWeapon;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortWorldItemDefinition*               Item;                                              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.AthenaEquippedItemBase.HasAmmoChanged
// 0x0001 (0x0001 - 0x0000)
struct AthenaEquippedItemBase_HasAmmoChanged final
{
public:
	bool                                          bHasAmmo;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.AthenaEquippedItemBase.OnLocalAmmoChanged
// 0x0008 (0x0008 - 0x0000)
struct AthenaEquippedItemBase_OnLocalAmmoChanged final
{
public:
	int32                                         LocalCount;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LocalRemaining;                                    // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.AthenaEquippedItemBase.OnWeaponChanged
// 0x0010 (0x0010 - 0x0000)
struct AthenaEquippedItemBase_OnWeaponChanged final
{
public:
	class AFortWeapon*                            NewWeapon;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortWeapon*                            PrevWeapon;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.AthenaEquippedItemBase.ResourceCountChanged
// 0x0004 (0x0004 - 0x0000)
struct AthenaEquippedItemBase_ResourceCountChanged final
{
public:
	int32                                         ResourceCount;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.AthenaEquippedItemBase.ResourceTypeChanged
// 0x0010 (0x0010 - 0x0000)
struct AthenaEquippedItemBase_ResourceTypeChanged final
{
public:
	class UFortResourceItemDefinition*            Item;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ResourceCount;                                     // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FortniteUI.AthenaEquippedItemBase.SetViewModel
// 0x0008 (0x0008 - 0x0000)
struct AthenaEquippedItemBase_SetViewModel final
{
public:
	class UAthenaPlayerViewModel*                 ViewModel;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.AthenaEquippedItemBase.UtilityItemCountChanged
// 0x0004 (0x0004 - 0x0000)
struct AthenaEquippedItemBase_UtilityItemCountChanged final
{
public:
	int32                                         Remaining;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.AthenaEquippedItemBase.UtilityItemTypeChanged
// 0x0010 (0x0010 - 0x0000)
struct AthenaEquippedItemBase_UtilityItemTypeChanged final
{
public:
	class AFortWeapon*                            Weapon;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortWeaponItemDefinition*              Item;                                              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.AthenaEquippedItemBase.WeaponTypeChanged
// 0x0001 (0x0001 - 0x0000)
struct AthenaEquippedItemBase_WeaponTypeChanged final
{
public:
	EEquippedWeaponDisplay                        Mode;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.AthenaGamePhaseWidgetBase.HandleGamePhaseStepChanged
// 0x0001 (0x0001 - 0x0000)
struct AthenaGamePhaseWidgetBase_HandleGamePhaseStepChanged final
{
public:
	EAthenaGamePhaseStep                          GamePhaseStep;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.AthenaGamePhaseWidgetBase.OnGamePhaseStepChanged
// 0x0001 (0x0001 - 0x0000)
struct AthenaGamePhaseWidgetBase_OnGamePhaseStepChanged final
{
public:
	EAthenaGamePhaseStep                          GamePhaseStep;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortSubGameSelectButtonBase.UpdateButtonState
// 0x0001 (0x0001 - 0x0000)
struct FortSubGameSelectButtonBase_UpdateButtonState final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortUIStateWidget_NUI.OnEnterState
// 0x0001 (0x0001 - 0x0000)
struct FortUIStateWidget_NUI_OnEnterState final
{
public:
	EFortUIState                                  PreviousUIState;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortUIStateWidget_NUI.OnExitState
// 0x0001 (0x0001 - 0x0000)
struct FortUIStateWidget_NUI_OnExitState final
{
public:
	EFortUIState                                  NextUIState;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortUIStateWidget_NUI.OnFrontEndVisibilityUpdated
// 0x0003 (0x0003 - 0x0000)
struct FortUIStateWidget_NUI_OnFrontEndVisibilityUpdated final
{
public:
	bool                                          bHideHeader;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHideFooter;                                       // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHideChatWidget;                                   // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortUIStateWidget_NUI.PopContentWidget
// 0x0008 (0x0008 - 0x0000)
struct FortUIStateWidget_NUI_PopContentWidget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortUIStateWidget_NUI.PopContentWidgetInternal
// 0x0010 (0x0010 - 0x0000)
struct FortUIStateWidget_NUI_PopContentWidgetInternal final
{
public:
	struct FContentPushState                      State;                                             // 0x0000(0x0003)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortUIStateWidget_NUI.PushContentWidget
// 0x0008 (0x0008 - 0x0000)
struct FortUIStateWidget_NUI_PushContentWidget final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortUIStateWidget_NUI.PushContentWidgetAdvanced
// 0x0010 (0x0010 - 0x0000)
struct FortUIStateWidget_NUI_PushContentWidgetAdvanced final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHideHeader;                                       // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHideFooter;                                       // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHideChatWidget;                                   // 0x000A(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FortniteUI.FortUIStateWidget_NUI.PushContentWidgetInternal
// 0x0010 (0x0010 - 0x0000)
struct FortUIStateWidget_NUI_PushContentWidgetInternal final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FContentPushState                      State;                                             // 0x0008(0x0003)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FortniteUI.FortUIStateWidget_NUI.SetFrontEndVisibility
// 0x0003 (0x0003 - 0x0000)
struct FortUIStateWidget_NUI_SetFrontEndVisibility final
{
public:
	bool                                          bHideHeader;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHideFooter;                                       // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHideChatWidget;                                   // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.AthenaHUDBase.OnHUDScaleChanged
// 0x0004 (0x0004 - 0x0000)
struct AthenaHUDBase_OnHUDScaleChanged final
{
public:
	float                                         HUDScale;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.AthenaHUDBase.SetFullScreenMapVisibility
// 0x0001 (0x0001 - 0x0000)
struct AthenaHUDBase_SetFullScreenMapVisibility final
{
public:
	bool                                          bIsVisible;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.AthenaHUDBase.ViewModelChanged
// 0x0008 (0x0008 - 0x0000)
struct AthenaHUDBase_ViewModelChanged final
{
public:
	class UAthenaPlayerViewModel*                 ViewModel;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortStoreContext.CardAddedToSummaryComplete
// 0x0001 (0x0001 - 0x0000)
struct FortStoreContext_CardAddedToSummaryComplete final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortStoreContext.CardBackRevealComplete
// 0x0001 (0x0001 - 0x0000)
struct FortStoreContext_CardBackRevealComplete final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortStoreContext.CardEntryComplete
// 0x0001 (0x0001 - 0x0000)
struct FortStoreContext_CardEntryComplete final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortStoreContext.CardExitComplete
// 0x0001 (0x0001 - 0x0000)
struct FortStoreContext_CardExitComplete final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortStoreContext.CardFlipComplete
// 0x0001 (0x0001 - 0x0000)
struct FortStoreContext_CardFlipComplete final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortStoreContext.CardFrontRevealComplete
// 0x0001 (0x0001 - 0x0000)
struct FortStoreContext_CardFrontRevealComplete final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortStoreContext.CardPackDestroyComplete
// 0x0001 (0x0001 - 0x0000)
struct FortStoreContext_CardPackDestroyComplete final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortStoreContext.CardPackOpeningComplete
// 0x0001 (0x0001 - 0x0000)
struct FortStoreContext_CardPackOpeningComplete final
{
public:
