#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_SurvivorRescue

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GAB_SurvivorRescue.GAB_SurvivorRescue_C
// 0x0028 (0x0B10 - 0x0AE8)
class UGAB_SurvivorRescue_C final : public UFortGameplayAbility
{
public:
	uint8                                         Pad_AE8[0x8];                                      // 0x0AE8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AF0(0x0008)(Transient, DuplicateTransient)
	class UClass*                                 BP_VictoryDrone;                                   // 0x0AF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RescueCompleted;                                   // 0x0B00(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B01[0x7];                                      // 0x0B01(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  Rescuer;                                           // 0x0B08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GAB_SurvivorRescue(int32 EntryPoint);
	void WaitForFinishRescueEvent();
	void K2_OnEndAbility(bool bWasCancelled);
	void Cancelled_8BD132F745BDCD15EBF232861F392E7B(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Completed_8BD132F745BDCD15EBF232861F392E7B(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void EventReceived_AE3E49574CEC70DFC62B01973CCF7515(const struct FGameplayEventData& Payload);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void PlayRescueAnimation();
	void RescueComplete();
	void SpawnVictoryDrone();
	void Triggered_8BD132F745BDCD15EBF232861F392E7B(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GAB_SurvivorRescue_C">();
	}
	static class UGAB_SurvivorRescue_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGAB_SurvivorRescue_C>();
	}
};

}

