#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAT_ConstructorActiveAbility

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GAT_ActiveAbility_classes.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GAT_ConstructorActiveAbility.GAT_ConstructorActiveAbility_C
// 0x00C0 (0x0BC0 - 0x0B00)
class UGAT_ConstructorActiveAbility_C : public UGAT_ActiveAbility_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GAT_ConstructorActiveAbility_C;     // 0x0B00(0x0008)(Transient, DuplicateTransient)
	struct FGameplayEventData                     Event_Data;                                        // 0x0B08(0x00A8)(Edit, BlueprintVisible, DisableEditOnInstance)
	class APlayerPawn_Constructor_C*              ConstructorPlayerPawn;                             // 0x0BB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          isStaminaLockedOut;                                // 0x0BB8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          isAutoCommitted;                                   // 0x0BB9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_GAT_ConstructorActiveAbility(int32 EntryPoint);
	void K2_ActivateAbility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GAT_ConstructorActiveAbility_C">();
	}
	static class UGAT_ConstructorActiveAbility_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGAT_ConstructorActiveAbility_C>();
	}
};

}

