#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HordeWaveModifiersWidget

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass HordeWaveModifiersWidget.HordeWaveModifiersWidget_C
// 0x0030 (0x0250 - 0x0220)
class UHordeWaveModifiersWidget_C final : public UFortUserWidget
{
public:
	class UVerticalBox*                           ModifierVertBox;                                   // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UHordeWaveModifiersTile_C*>      ModifierWidgets;                                   // 0x0228(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	int32                                         CurPresentedIdx;                                   // 0x0238(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   OnAllModifiersPresented;                           // 0x0240(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnModifiersAdded(TArray<class UFortGameplayModifierItemDefinition*>& Modifiers, bool StartPresentationImmediately);
	void PresentNextModifier();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HordeWaveModifiersWidget_C">();
	}
	static class UHordeWaveModifiersWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHordeWaveModifiersWidget_C>();
	}
};

}

