#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemTransformKeyPicker

#include "Basic.hpp"


namespace SDK::Params
{

// Function ItemTransformKeyPicker.ItemTransformKeyPicker_C.SetSelectedKey
// 0x0010 (0x0010 - 0x0000)
struct ItemTransformKeyPicker_C_SetSelectedKey final
{
public:
	class UFortAccountItem*                       AccountKey;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetSelectedItem_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function ItemTransformKeyPicker.ItemTransformKeyPicker_C.GetSelectedKey
// 0x0020 (0x0020 - 0x0000)
struct ItemTransformKeyPicker_C_GetSelectedKey final
{
public:
	class UFortItem*                              SelectedKey;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetSelectedItem_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItem*                              K2Node_DynamicCast_AsFort_Item;                    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function ItemTransformKeyPicker.ItemTransformKeyPicker_C.NavigateToSelectedItem
// 0x0018 (0x0018 - 0x0000)
struct ItemTransformKeyPicker_C_NavigateToSelectedItem final
{
public:
	class UFortItem*                              InItem;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItem*                              Item;                                              // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetSelectedItem_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function ItemTransformKeyPicker.ItemTransformKeyPicker_C.NavigateToFirstItem
// 0x0010 (0x0010 - 0x0000)
struct ItemTransformKeyPicker_C_NavigateToFirstItem final
{
public:
	class UObject*                                CallFunc_GetSelectedItem_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetSelectedIndex_ReturnValue;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

}

