#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LinearTimecode

#include "Basic.hpp"

#include "LinearTimecode_structs.hpp"


namespace SDK::Params
{

// Function LinearTimecode.LinearTimecodeComponent.GetDropTimeCodeFrameNumber
// 0x002C (0x002C - 0x0000)
struct LinearTimecodeComponent_GetDropTimeCodeFrameNumber final
{
public:
	struct FDropTimecode                          Timecode;                                          // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         FrameNumber;                                       // 0x0028(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LinearTimecode.LinearTimecodeComponent.SetDropTimecodeFrameNumber
// 0x0054 (0x0054 - 0x0000)
struct LinearTimecodeComponent_SetDropTimecodeFrameNumber final
{
public:
	struct FDropTimecode                          Timecode;                                          // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         FrameNumber;                                       // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDropTimecode                          OutTimecode;                                       // 0x002C(0x0028)(Parm, OutParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// Function LinearTimecode.LinearTimecodeComponent.GetDropFrameNumber
// 0x0004 (0x0004 - 0x0000)
struct LinearTimecodeComponent_GetDropFrameNumber final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LinearTimecode.DropTimecodeToStringConversion.Conv_DropTimecodeToString
// 0x0038 (0x0038 - 0x0000)
struct DropTimecodeToStringConversion_Conv_DropTimecodeToString final
{
public:
	struct FDropTimecode                          InTimecode;                                        // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

