#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MatchStatsGrid

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function MatchStatsGrid.MatchStatsGrid_C.SetStat (Float)
// 0x0010 (0x0010 - 0x0000)
struct MatchStatsGrid_C_SetStat__Float_ final
{
public:
	class UCommonNumericTextBlock*                Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Value;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function MatchStatsGrid.MatchStatsGrid_C.SetStat (Integer)
// 0x0010 (0x0010 - 0x0000)
struct MatchStatsGrid_C_SetStat__Integer_ final
{
public:
	class UCommonNumericTextBlock*                Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Value;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function MatchStatsGrid.MatchStatsGrid_C.SetStats
// 0x0074 (0x0074 - 0x0000)
struct MatchStatsGrid_C_SetStats final
{
public:
	struct FAthenaMatchStats                      AthenaMatchStats;                                  // 0x0000(0x0074)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};

}

