#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PopupCenterMessageModalPanel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PopupCenterMessageModalPanel.PopupCenterMessageModalPanel_C
// 0x0070 (0x0460 - 0x03F0)
class UPopupCenterMessageModalPanel_C final : public UFortActivatablePanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03F0(0x0008)(Transient, DuplicateTransient)
	class UCommonTextBlock*                       CenterMessageText;                                 // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULeaveButton_C*                         LeaveButton;                                       // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               MessageOverlay;                                    // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   WaitingForPlayersText;                             // 0x0410(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   WaitingForOutpostOwnerText;                        // 0x0428(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTimerHandle                           MatchTimerHandle;                                  // 0x0440(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class FText                                   WaitingForMatchToBeginText;                        // 0x0448(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_PopupCenterMessageModalPanel(int32 EntryPoint);
	void OnActivated();
	void StartMatchTimer();
	void UpdateMatchTimer();
	void UpdateState(ECenterPopupMessageStateEnum NewState);
	void UpdateMatchTimerText(bool* StopTimer);
	void LeaveZone();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PopupCenterMessageModalPanel_C">();
	}
	static class UPopupCenterMessageModalPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPopupCenterMessageModalPanel_C>();
	}
};

}

