#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RewardInfoButtonWidget

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass RewardInfoButtonWidget.RewardInfoButtonWidget_C
// 0x0048 (0x0870 - 0x0828)
class URewardInfoButtonWidget_C final : public UFortRewardInfoButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0828(0x0008)(Transient, DuplicateTransient)
	class UHorizontalBox*                         ItemDetails;                                       // 0x0830(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ItemInfo;                                          // 0x0838(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   DisplayNameText;                                   // 0x0840(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   DisplayQuantity;                                   // 0x0858(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_RewardInfoButtonWidget(int32 EntryPoint);
	void HandleDifferentItemOrQuantitySetBP();
	void SetShowDescriptionBP(bool bInShowDescription);
	void GetDisplayName(class FText* DisplayName);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RewardInfoButtonWidget_C">();
	}
	static class URewardInfoButtonWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URewardInfoButtonWidget_C>();
	}
};

}

