#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ScoreBadgeProviderMission

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CollectionMissionBadgeDisplayInfo_structs.hpp"


namespace SDK::Params
{

// Function ScoreBadgeProviderMission.ScoreBadgeProviderMission_C.GetScoreBadgeInfos
// 0x0018 (0x0018 - 0x0000)
struct ScoreBadgeProviderMission_C_GetScoreBadgeInfos final
{
public:
	EStatCategory                                 ScoreCategory;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCollectionMissionBadgeDisplayInfo> BadgeInfos;                                    // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor)
};

// Function ScoreBadgeProviderMission.ScoreBadgeProviderMission_C.GetTotalScore
// 0x0008 (0x0008 - 0x0000)
struct ScoreBadgeProviderMission_C_GetTotalScore final
{
public:
	EStatCategory                                 ScoreCategory;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Score;                                             // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

