#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ScoreBarsWidget

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "CollectionMissionBadgeDisplayInfo_structs.hpp"
#include "SlateCore_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ScoreBarsWidget.ScoreBarsWidget_C
// 0x0A78 (0x0CB8 - 0x0240)
class UScoreBarsWidget_C final : public UFortHUDElementWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0240(0x0008)(Transient, DuplicateTransient)
	class UCollectionMultiProgressBar_C*          BuildingMultiProgressBar;                          // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScoreMessageNumber_C*                  BuildingScoreMessageNumber;                        // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCollectionMultiProgressBar_C*          CombatMultiProgressBar;                            // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScoreMessageNumber_C*                  CombatScoreMessageNumber;                          // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ScoreBarElement;                                   // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           ScoreMessageBox;                                   // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               ScoreNumberPaddingBox;                             // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCollectionMultiProgressBar_C*          UtilityMultiProgressBar;                           // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScoreMessageNumber_C*                  UtilityScoreMessageNumber;                         // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AFortMission*                           TrackedMission;                                    // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCollectionMissionBadgeDisplayInfo> CombatBadgeInfos;                              // 0x0298(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FCollectionMissionBadgeDisplayInfo> BuildingBadgeInfos;                            // 0x02A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FCollectionMissionBadgeDisplayInfo> UtilityBadgeInfos;                             // 0x02B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	int32                                         CurrentCombatScore;                                // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentBuildingScore;                              // 0x02CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentUtilityScore;                               // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShowTopBarIcons;                                  // 0x02D4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bShowSideBarIcons;                                 // 0x02D5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bOnlyShowIconsForTopCategory;                      // 0x02D6(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bOnlyShowBarsWithCountInRange;                     // 0x02D7(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFortMultiSizeBrush                    CombatCategoryIcon;                                // 0x02D8(0x0330)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FFortMultiSizeBrush                    BuildingCategoryIcon;                              // 0x0608(0x0330)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FFortMultiSizeBrush                    UtilityCategoryIcon;                               // 0x0938(0x0330)(Edit, BlueprintVisible, DisableEditOnInstance)
	EFortBrushSize                                CategoryIconSize;                                  // 0x0C68(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortBrushSize                                BadgeIconSize;                                     // 0x0C69(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C6A[0x2];                                      // 0x0C6A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                CategoriesMargin;                                  // 0x0C6C(0x0010)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	struct FMargin                                BarsMargin;                                        // 0x0C7C(0x0010)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	struct FMargin                                BarsIconMargin;                                    // 0x0C8C(0x0010)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9C[0x4];                                      // 0x0C9C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUIMessageManager*                  MessageManager;                                    // 0x0CA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxScoreMessagesDisplayed;                         // 0x0CA8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDisplayScoreStream;                               // 0x0CAC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CAD[0x3];                                      // 0x0CAD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BarHeightOverride;                                 // 0x0CB0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ScoreBarsWidget(int32 EntryPoint);
	void Destruct();
	void Construct();
	void HandleMissionsUpdated();
	void InitializeScoreBars();
	void HasValidBadgeInfos(bool* bHasValidBadgeInfos);
	void UpdateScoreTotals();
	void HandleUpdateUI(class AFortMissionState* Mission);
	void UpdateScoreBars();
	void InitializeIcons();
	void HandleScoreStatChanged(int32 Delta, class FText& Name_0, EFortReplicatedStat StatType, EStatCategory StatCategory);
	void TryGetNextScoreMessage();
	void HandleScoreMessageExpired(class UFortUIMessageItemWidget* Expired_Message);
	void RegisterForScoreStreamEvents();
	void HideScoreMessageSlots();
	void HandleMessageDisplayed(class UFortUIMessageItemWidget* ItemWidget);
	void HandleScoreNumberChanged(EStatCategory ScoreCategory);
	void UnregisterForScoreStreamEvents();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ScoreBarsWidget_C">();
	}
	static class UScoreBarsWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScoreBarsWidget_C>();
	}
};

}

