#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpectatorPlayerSelectionUI

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SpectatorPlayerSelectionUI.SpectatorPlayerSelectionUI_C
// 0x05A8 (0x07B8 - 0x0210)
class USpectatorPlayerSelectionUI_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0210(0x0008)(Transient, DuplicateTransient)
	class UScrollBox*                             ScrollBox_151;                                     // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FButtonStyle                           ButtonStyle;                                       // 0x0220(0x0278)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UButton*, class AFortPlayerState*> ButtonToPlayerStateMap;                            // 0x0498(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	struct FButtonStyle                           FollowedButtonStyle;                               // 0x04E8(0x0278)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class AFortPlayerState*, class UButton*> PlayerStateToButtonMap;                            // 0x0760(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)
	class UButton*                                FollowedPlayerButton;                              // 0x07B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SpectatorPlayerSelectionUI(int32 EntryPoint);
	void PlayerBecameIrrelevant(class AFortPlayerState* NewlyRelevantPlayer);
	void PlayerBecameRelevant(class AFortPlayerState* NewlyRelevantPlayer);
	void OnFollowedPlayerChanged(class AFortPlayerControllerSpectating* SpectatorPC, class AFortPlayerState* NewFollowedPlayer);
	void OnPlayerButtonPressed();
	void Construct();
	void AddPlayerElement(class AFortPlayerStateAthena* Player);
	void FindPlayerWithPressedButton(class AFortPlayerState** Player);
	void SetFollowedPlayerButton(class UButton* NewButton);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SpectatorPlayerSelectionUI_C">();
	}
	static class USpectatorPlayerSelectionUI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpectatorPlayerSelectionUI_C>();
	}
};

}

